// pages/comment/comment.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
      list:[{
        pick:'https://wujunhui.xyz/zz-zxj.png',
        nickname:'你个废物',
        content: '有情亦是无情，情字写起来大简单，而这个字，却蕴含了世间太多喜怒喜乐: 砉欢亮食。真多少人为了情字，甘愿白发三千丈，: 有多少人为了情字，甘愿衣带渐竟终不悔，为伊消得人憔悴',
        time: '12 - 25 21: 20',
      },{
          pick: 'https://wujunhui.xyz/zz-xhy.png',
          nickname: '猪是糖缺死的',
          content: '你之于我，是灵魂繁华盛世的一场谋反，我怯懦了，你的嚣张使我的朝代兵荒马乱，血流成河。你之于我，是人生独幕戏剧的唯一灯光，我追随着，你的肆意使我的表演自顾不暇，满场笑话。我之于你，也许只是一棵草茎而已，无聊捻弄着，随后留我于荒野，汁液枯竭。怪我，让你轻而易举篡改了过往',
          time: '12 - 25 21: 20',
        }, {
          pick: 'https://wujunhui.xyz/zz-zdh.png',
          nickname: '四肢发达头脑简单',
          content: '人的一生， 究竟可以目睹几次花开，几次花落，又要经历几番相遇，几番离别。前世有因今生有果，那些与你此生交错相守的人，都是源自一份前生怎样的未了情缘?生命中有太多的人，从第一面相见，便是似曾相识，莫名亲切。纵使时光飞逝，多少年不曾再见，那份初始的美好，依然温婉着流年岁月。有些人对你好，不需要条件，不需要理由，很多时候就是一种感觉，源于内心始于真诚。尘世中的我们，总是随着季节的流转而仓促奔走，在这个过程中， 我们又遇到了多少人，又错过了多少人。由来相信世间万物，冥冥之中，皆有情缘注定。 就像日与月的相守，风与叶的相伴，纵是无言， 也契合。或许时光真的可以带走很多东西, 也改变很多东西！',
          time: '12 - 25 21: 20',
        },{
          pick:'https://wujunhui.xyz/zz-wyy.png',
          nickname:'清新的小女孩',
          content:'这首歌的大概意思是:两个青梅竹马两小无猜的孩子,长大后因为家庭的逐渐差别,导致女孩的家庭不许女孩再找这个男孩,而这个男孩知道后,成全了女孩父母的想法,但是后来男孩用自己的天赋写词和作曲成为了一个歌星,想用自己的努力来赢得女孩家庭的同意,但是女孩的父母告诉男孩，女孩已经结婚了,叫男孩不要再找她了。后来男孩在和女孩分开又相遇了，男孩还是一直喜欢着这个女孩,但是女孩已为人母，男孩直到这时才真正明白,这个女孩今生已经和他不可能再有任何的交集了,后来男孩写了这首歌来缅怀自己的这段感情,并告诉自己去追寻自己的幸福。￼',
          time:'12 - 25 21: 20'
        }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})